recipes/tortilla-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tortilla Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Tortilla Soup</h1>
<p>
<a href="http://www.simplyrecipes.com/recipes/tortilla_soup/">Original link</a>
</p>

<div id="outline-container-org9b54aaa" class="outline-2">
<h2 id="org9b54aaa">Ingredients</h2>
<div class="outline-text-2" id="text-org9b54aaa">
<ul class="org-ul">
<li>6 (6-inch) corn tortillas, preferably a little old and dried out</li>
<li>1/4 cup canola oil, peanut oil, or other high smoke-point oil</li>
<li>1/2 cup chopped onion</li>
<li>2 cloves garlic, minced</li>
<li>1 medium Anaheim, poblano or jalapeño chile, seeded, veins removed, chopped (Depending on the hotness and flavor desired. You can also mix chiles - 1 Anaheim and a half jalapeño.)</li>
<li>4 cups chicken broth or homemade chicken stock</li>
<li>1 can (400 g) diced tomatoes, undrained (recommended Muir Glen fire-roasted)</li>
<li>1/2 teaspoon coarse salt (kosher or sea salt)</li>
<li>1 1/2 cups shredded cooked chicken</li>
<li>1 ripe avocado</li>
<li>1/2 cup (50 g) shredded Monterey Jack cheese (or mild cheddar)</li>
<li>Chopped fresh cilantro</li>
<li>1 lime, cut into wedges</li>
</ul>
</div>
</div>

<div id="outline-container-org2b99d31" class="outline-2">
<h2 id="org2b99d31">Method</h2>
<div class="outline-text-2" id="text-org2b99d31">
<ol class="org-ol">
<li>Fry tortilla strips: If you are starting with somewhat old, dried out tortillas, great. If not and you are starting with relatively fresh tortillas, put them on a baking sheet and put them in the oven at 90&deg;C for 10-15 minutes to dry them out a bit. It is best to start with tortillas that don't have a lot of moisture in them. Cut the tortillas in half, and then cut the halves into 1/4-inch wide strips. Heat oil over medium-high heat in a 3-quart pot. Working in three batches, fry the tortilla strips in the oil, until lightly browned and crisp. Remove the tortilla strips from the pan and let drain on a paper-towel-lined plate.</li>
<li>Saute onions, chile, garlic: Add the chopped onions to the pan, cook 2 minutes, stirring frequently. Add the chopped chile and cook for 2-3 minutes more, until the onions and chiles have softened. Add the garlic and cook for 30 seconds more.</li>
<li>Add broth, tomatoes, salt, chicken: Add the broth, tomatoes, and salt. Increase the heat to high, heat until the soup begins to boil, then reduce the heat to a low simmer, cover and simmer for 15 minutes. Add the shredded chicken and cook until heated through.</li>
<li>Serve with tortilla strips and garnishes: To serve, pit, peel, and cut the avocado into 1-inch pieces. Divide half of tortilla strips among 4 individual serving bowls; ladle in soup. Top with avocado and cheese; garnish with remaining tortilla strips and cilantro. Serve with lime wedges.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
